{
  "ANALYSIS": "Analyse",
  "DESCRIPTION": "Beschreibung",
  "CIPHERTEXT-INPUT-LABEL": "Geheimtext",
  "NGRAM": "N-Gramm",
  "GRAM": "Gramm",
  "AMOUNT": "Menge",
  "AUTHOR": "Autor",
  "TEXTLENGTH": "Textlänge",
  "LANG": "de",
  "VIEW-OPTION": "Ansicht als",
  "VIEW-OPTION-TABLE": "Tabelle",
  "VIEW-OPTION-DIAGRAM": "Diagramm",
  "BUTTON-LEFT-SHIFT": "Links",
  "BUTTON-RIGHT-SHIFT": "Rechts",
  "OUTPUT-LABEL": "Ausgabe",

  "REFERENCES": "Referenzen",
  "REFERENCE-WIKI": "Vigenère: <a href='https://de.wikipedia.org/wiki/Vigen%C3%A8re-Chiffre' target='_blank' rel='noopener'>https://de.wikipedia.org/wiki/Vigen%C3%A8re-Chiffre</a>",
  "REFERENCE-CHART": "verwendet für das Diagramm",

  "DESCRIPTION-FIRST-PARAGRAPH": "Dieses Tool veranschaulicht Ihnen, wie man eine Vigenère-Verschlüsselung brechen kann. Als ersten Schritt geben Sie bitte einen mit Vigenère verschlüsselten Text ein. Danach können Sie die Länge der N-Gramme auswählen, mit der die Analyse durchgeführt wird. Diese Analyse basiert auf dem englischen Alphabet, somit werden nicht zum Alphabet gehörende Zeichen wie '?', Kommas und Leerzeichen herausgefiltert",
  "DESCRIPTION-SECOND-PARAGRAPH": "Im Diagramm werden dann die möglichen Schlüssellängen angezeigt, dabei werden auch die Teiler der Autokorrelationsresultate ausgerechnet und mit ins Diagramm einbezogen.",
  "DESCRIPTION-THIRD-PARAGRAPH": "Die zweite Ansicht, die zur Verfügung steht, ist eine Tabelle, in dieser werden alle N-Gramme, bei denen die Abständen zwischen ihnen mindestens einen gemeinsamen Teiler haben, angezeigt. Diese Teiler werden in der Tabelle farblich und mit einem Kreuz angezeigt. Die wahrscheinlichste Schlüssellänge verfügt über die meisten Einträge. Die möglichen Schlüssel werden unter dem Diagramm angezeigt, diese sind nach ihrer Wahrscheinlichkeit geordnet.",
  "DESCRIPTION-FOURTH-PARAGRAPH": "Drücken Sie auf eine der Schlüssellängen werden zwei Buchstabenverteilungen angezeigt. Die obere Verteilung ist die aus der englischen Sprache, in der unteren Verteilung werden abhängig von der ausgewählten Schlüssellänge die Buchstaben des verschlüsselten Textes in n Gruppen aufgeteilt. Der erste Buschstabe repräsentiert die erste Gruppe. Gehen wir davon aus Sie haben sich für die Schlüssellänge 7 entschieden, dann kommt in die erste Gruppe der erste , 7., 14. und so weiter in die erste Gruppe . Nun wird mit Hilfe einer Buchstabenhäufigkeitsverteilung jede Gruppe einzeln betrachtet. Ist z.B. in der dritten Gruppe der Buchstabe 'G' am häufigsten vorhanden, entspricht er aller Wahrscheinlichkeit nach im Klartext dem 'E'.",
  "DESCRIPTION-FIFTH-PARAGRAPH": "Bei jeder Verschiebung der Verteilungen wird der dazugehörige Autokorrelationswert ausgerechnet und angezeigt, es ist erstrebenswert den kleinsten Wert zu finden. Außerdem wird bei jeder Verschiebung der Text mit dem vorhanden Schlüssel entschlüsselt.",
  "DESCRIPTION-SIXTH-PARAGRAPH": "Für das automatische Lösen einer Vigenère-Verschlüsselung sind Sie eingeladen die Software CrypTool2 (<a href='https://www.cryptool.org/de/cryptool2'>https://www.cryptool.org/de/cryptool2</a>) zu nutzen.",

  "CHOOSE-KEYSIZE-LABEL": "Wählen Sie eine Schlüsselgröße. Hier sind die möglichen Schlüsselgrößen sortiert nach ihrer Wahrscheinlichkeit in absteigender Reihenfolge.",
  "LETTER-BUTTON-DESCRIPTION-FIRST": "Sie glauben, die Schlüsselgröße ist ",
  "LETTER-BUTTON-DESCRIPTION-SECOND": " Da wir nicht wissen, welche Buchstaben der Schlüssel beinhaltet, nehmen wir den Schlüssel ",
  "LETTER-BUTTON-DESCRIPTION-THIRD": " Die erste Tabelle unten zeigt die normale englische Buchstabenhäufigkeit. Klicken Sie auf einen Buchstaben, um die Buchstabenhäufigkeit des Chiffriertextes zu sehen. Wenn Sie beispielsweise auf die erste Schaltfläche klicken, sehen Sie die Buchstabenhäufigkeit für ",
  "LETTER-BUTTON-DESCRIPTION-FOURTH": "Versuchen Sie, die Häufigkeit des Chiffriertextes so anzupassen, dass sie der normalen englischen Häufigkeit entspricht und der Autokorrelationswert der kleinste ist.",
  "ENGLISH-TABLE-LABEL": "Normale englische Buchstabenhäufigkeit in %",
  "POSSIBLE-KEYSIZE-TABLE-LABEL": "Mögliche Schlüssellängen",
  "CIPHERTEXT-TABLE-LABEL": "Buchstabenhäufigkeit des Chiffretextes in %",
  "AUTOCORRELAION-LABEL": "Autokorrelationswert der beiden Verteilungen:"
}
