{
    "DATE_LOCALE": "ISO",
    "walkthrough": {
        "showLastMessage": "Show last message",
        "showWelcomeCard": "Show welcome panel",
        "startWalkthrough": "Start walkthrough",
        "startTour": "Start tour",
        "proceedNextStep": "Proceed with next step",
        "completeStep": "Complete this step",
        "cancelWalkthrough": "Cancel walkthrough",
        "walkthroughCompleted": "Walkthrough completed",
        "welcome": {
            "header": "Welcome!",
            "para2": "<strong>Alice</strong>'s app records which smartphones have come close to her. Alice likes to be informed about contact with infected people.",
            "para3": "The best experience for this page can be achieved by using a desktop PC.<br/>If you use a smartphone, take a look at the <a href='https://corona-tracing.cryptool.org/'>Corona-Tracing visualization page</a>."
        },
        "step1": {
            "task": {
                "header": "Walkthrough: 1) Let's start with simulating Alice getting in contact with other people!",
                "para1": "Please perform the following actions:<ol><li>Choose a person in the area \"<i>Other person's broadcast history</i>\".</li><li>The list in this area will show the history of <strong class='broadcast-ids'></strong> broadcasted by the chosen person at certain points in time.</li><li>Use the \"Previous day\" and \"Next day\" buttons to choose a specific day.</li><li>Click on one of the <strong class='broadcast-id'></strong> entries to simulate a contact incident with <strong>Alice</strong> during the specified time slot.</li></ol>",
                "para2": "A dialog will open up which lets you enter the duration of the contact."
            },
            "success": {
                "header": "Walkthrough: 2) Successfully simulated contact!",
                "para1": "You have successfully simulated <strong>Alice</strong> getting into contact with another person. The <strong class='broadcast-id'></strong> of the other person's <strong>tracing app</strong> has been received by <strong>Alice</strong>'s <strong>tracing app</strong> and recorded in her smartphone's storage. It is shown in the area \"<i>Alice's contact list</i>\".",
                "para2": "Note that the stored entry in <strong>Alice</strong>'s contact list neither reveals any information about the other person, nor requires making the contact incident public to anyone.<br />Furthermore, it wouldn't even be possible to link different entries in the contact list to the same person, because the <strong class='broadcast-ids'></strong> keep changing every few minutes using a cryptographic secure approach.",
                "para3": "You can now add more contact entries to various different persons to <strong>Alice</strong>'s list or proceed with the next step of the walkthrough."

            }
        },
        "step2": {
            "task": {
                "header": "Walkthrough: 3) What happens if someone turns out to be infected?",
                "para1": "Now let's simulate what will happen if some person learns today that he/she has been infected with the <strong>coronavirus</strong>.</br>The aim of the <strong>tracing app</strong> is to let <strong>Alice</strong> find out that contact with an infected person occured within the infection period.<br />On the other hand, the infected person itself should remain <strong>anonymous</strong>.",
                "para2": "When a person gets confirmation about his or her infection state, the health authorities will authorize him/her to report this voluntarily using the <strong>tracing app</strong>.",
                "para3": "Please perform the following actions: <ol><li>Choose a person in the area \"<i>Other person's broadcast history</i>\" and select the day from which on the person is assumed to be infectious.</li><li>Click on the \"<i>Person reports own infection</i>\" button to simulate the person reporting himself/herself as infected starting from the selected day.</li></ol>For this walkthrough, please report a person which had already been in contact with <strong>Alice</strong> within the infection period."
            },
            "error": {
                "header": "Walkthrough: 3) Please reconsider your report!",
                "para1": "You simulated a person reporting himself/herself as infected which had no contact to <strong>Alice</strong> during the infection period.",
                "para2": "This is a valid scenario, but for this walthrough, please report someone who had contact with <strong>Alice</strong> in the infection period.<br />You can also add a new contact incident with the reported person now to achieve this."
            },
            "success": {
                "header": "Walkthrough: 4) Successfully simulated a person reporting himself/herself!",
                "para1": "You have successfully simulated a person reporting himself/herself as infected. The result of this action is that the person's <strong>tracing app</strong> sends anonymous data to a <strong>public server</strong>. Only those information which are required for contact tracing will be sent and stored.<br />To be more precise, only information needed for deriving all <strong class='broadcast-ids'></strong> broadcasted by the person's <strong>tracing app</strong> during the infection period will be sent.",
                "para2": "The information on the <strong>public server</strong> can be accessed by everyone.",
                "para3": "You can now simulate reporting more persons or proceed with the next step of the walkthrough."
            }
        },
        "step3": {
            "task": {
                "header": "Walkthrough: 5) How does Alice learn about the contact?",
                "para1": "<strong>Alice</strong>'s <strong>tracing app</strong> is able to access all entries of the <strong>public server</strong>. Each entry reflects a non-personalized piece of information, namely the <strong class='day-key'></strong>. This key allows deriving all <strong class='broadcast-ids'></strong> for a specific time frame using a cryptographic method.<br />The <strong>tracing app</strong> is thus able to generate all <strong class='broadcast-ids'></strong> during infection periods and match them against <strong>Alice</strong>'s personal contact list.",
                "para2": "By comparing the day plus the <strong class='broadcast-id'></strong> of each entry, <strong>Alice</strong> is able to find out if she had contact with a person which reported himself/herself as infected.",
                "para3": "To demonstrate this approach, click on one of the entries of the <strong>public server</strong> in the area \"<i>List of infections on public server</i>\"."
            },
            "success": {
                "header": "Walkthrough: 6) Investigating a single entry of the public server",
                "para1": "In the area \"<i>Matching public server entry against contact list</i>\", you can now see all <strong class='broadcast-ids'></strong> which are derivable from the <strong class='day-key'></strong> of the <strong>public server</strong>'s entry.<br />The number of matches with <strong>Alice</strong>'s contact list is shown.",
                "para2": "Note that during the whole process, there was no need for <strong>Alice</strong> to send any data to a central instance. Her contact list still resides exclusively on her smartphone.",
                "para3": "You can now create more contact entries and report more persons to see the whole mechanism at work.<br />Pay special attention to the fact that contact entries of persons reported as being infected <strong>after</strong> the contact incident will <strong>not</strong> lead to a match with <strong>Alice</strong>'s contact list."
            }
        }
    },
    "tour": {
        "nextButton": "Next",
        "backButton": "Back",
        "quitButton": "Quit tour",
        "step1": {
            "description": "This area reflects the data which gets broadcasted (i.e.: sent out) by other person's tracing apps. You can simulate contact between the person and Alice by clicking on a time slot entry in the list."
        },
        "step2": {
            "description": "This area reflects the list of contact data as stored locally in Alice's tracing app."
        },
        "step3": {
            "description": "This area reflects the data about infected persons which is available to the public. No personalized information is included."
        },
        "step4": {
            "description": "You can use this area to inspect a single entry from the server and to match it against Alice's personal contact list."
        },
        "step5": {
            "title": "Selecting a person",
            "description": "You can use this box to select a person for which you like to simulate the contact with Alice."
        },
        "step6": {
            "title": "Selecting a day",
            "description": "You can use this pager to select a day in order to see the <strong class='broadcast-ids'></strong> broadcasted by the selected persons on the selected day."
        },
        "step7": {
            "title": "Broadcast history",
            "description": "This list shows all <strong class='broadcast-ids'></strong> which were broadcasted via Bluetooth by the selected person during the selected day. You can click on one entry in order to simulate contact with Alice within the specific time slot."
        },
        "step8": {
            "title": "Let a person report his/her own infection",
            "description": "When a person learns by a medical test that he/she has been infected several days ago, the person will be authorized to report themselves as infected using the tracing app. You can simulate this by using this button. Make sure to select the correct day on which the infection started."
        },
        "step9": {
            "title": "Walkthrough",
            "description": "After following these instructions, you can now take action yourself to learn more about the protocol in a playful way. Click on this button to call up the steps / actions in the instructions."
        }
    },
    "broadcastHistory": {
        "header": "Other person's broadcast history",
        "person": "Person",
        "initialKey": "Initial key",
        "initialKeyPopover": "The initial key is a random value generated for each person and stored only secretly on the person's device.\nThe initial key for this person is:",
        "previousDay": "Previous day",
        "nextDay": "Next day",
        "reportTooltip": "The person reports himself/herself as infected starting from the selected day.\nThe relevant private information will be sent to the public server.",
        "reportCaption": "Person reports own infection",
        "description": {
            "para1": "The following history lists all <strong class='broadcast-ids'></strong> which were broadcasted by <strong><span class='current-person'></span></strong> on <strong><span class='current-day'></span></strong> during particular time slots of that day. The <strong class='broadcast-ids'></strong> are renewed every <strong><span class='broadcast-id-refresh'></span> minutes</strong>.",
            "para2": "Click on an entry in the list to simulate what would have happened if <strong>Alice</strong> had contact during that time slot with <strong><span class='current-person'></span></strong>."
        },
        "timeSlotTooltip": "The time slot during which the <strong class='broadcast-id'></strong> has been broadcasted by the selected person.",
        "timeSlot": "Time slot",
        "broadcastIdTooltip": "Each <strong class='broadcast-id'></strong> is broadcasted during short time slots of <span class='broadcast-id-refresh'></span> minutes via Bluetooth.\nThey are recorded by the tracing apps of other persons near, but do not reveal any personalized information.",
        "addContactModal": {
            "title": "Add to Alice's contact list?",
            "question": "Are you sure you want to add contact with <b><span id='add-contact-list-modal-person'></span></b> at <b><span id='add-contact-list-modal-timeslot'></span></b> to Alice's contact list?",
            "duration": "Contact duration",
            "minute": "minute",
            "minutes": "minutes",
            "cancel": "Cancel",
            "add": "Add"
        },
        "reportModal": {
            "title": "Add to public server list?",
            "question": "Are you sure you want to report <b><span id='add-server-list-modal-person'></span></b> as being infected beginning from day <b><span id='add-server-list-modal-day'></span></b>?",
            "info": "The relevant anonymous <strong  class='day-keys'></strong> will be accessible by the public.",
            "cancel": "Cancel",
            "add": "Add"
        }
    },
    "contactList": {
        "header": "Alice's contact list",
        "description": {
            "para1": "Alice's app stores all <strong class='broadcast-ids'></strong> gathered via Bluetooth on contact with other persons' apps in her private contact list.",
            "para2": "This list is not available to anyone else."
        },
        "dayTooltip": "The day at which the contact happened.",
        "day": "Day",
        "durationTooltip": "The duration of the contact. This is relevant for the tracing app to determine how severe the contact to one or several persons has been. The app user will only be warned in case a certain intensity threshold is reached.",
        "duration": "Duration",
        "broadcastIdTooltip": "The <strong class='broadcast-id'></strong> which was broadcasted by the tracing app of the contact person. This <strong class='broadcast-id'></strong> does not reveal any information about the person in contact."
    },
    "matchingList": {
        "header": "Matching public server entry against contact list",
        "altDescription": "Select an entry from the public server to look, whether it's in Alice's contact list.",
        "description": {
            "para1": "Here all <strong class='broadcast-ids'></strong> are shown, which Alice's app derived from the <strong class='day-key'></strong> of one server entry",
            "para2": "Each entry in this generated list (day and <strong class='broadcast-id'></strong>) is matched against Alice's contact list in order to find out whether a contact with an infected person occured.",
            "para3": "Number of matches with Alice's contact list: <strong><span id='matching-counter'></span></strong>"
        },
        "matchButtonTooltip": "Turning on the filter will hide all entries in this list which do not match a <strong class='broadcast-id'></strong> entry in Alice's contact list.",
        "matchButtonCaption": "Filter matching <strong class='broadcast-ids'></strong>",
        "dayTooltip": "The day on which this <strong class='broadcast-id'></strong> has been broadcasted.",
        "day": "Day",
        "broadcastIdTooltip": "The <strong class='broadcast-id'></strong> which has been broadcasted by an infected person."
    },
    "serverList": {
        "header": "List of infections on public server",
        "description": {
            "para1": "The public server stores a list of <strong class='day-keys'></strong> voluntarily reported by infected persons.",
            "para2": "The data is anonymous (no connection can be made between them and an actual person)."
        },
        "dayTooltip": "The day to which the <strong class='day-key'></strong> belongs.",
        "day": "Day",
        "dayKeyTooltip": "A piece of information which was private to the user's tracing app before reporting it.\nIt allows deriving all <strong class='broadcast-ids'></strong> broadcasted by the person on one or several days."
    },
    "sizeWarning": {
        "header": "<strong>Attention:</strong> The screen of your device is too small for using this page!"
    }
}
