{
    "DATE_LOCALE": "de-DE",
    "walkthrough": {
        "showLastMessage": "Zeige die letzte Nachricht",
        "showWelcomePanel": "Zeige Begrüßungspanel",
        "startWalkthrough": "Anleitung starten",
        "startTour": "Tour starten",
        "proceedNextStep": "Mit dem nächsten Schritt fortfahren",
        "completeStep": "Diesen Schritt abschließen",
        "cancelWalkthrough": "Anleitung abbrechen",
        "walkthroughCompleted": "Anleitung abgeschlossen",
        "welcome": {
            "header": "Willkommen!",
            "para2": "Die App von <strong>Alice</strong> zeichnet auf, welche Smartphones ihr nahegekommen sind. Alice möchte über Kontakt mit infizierten Personen informiert werden.",
            "para3": "Die beste Erfahrung mit dieser Seite kann durch Nutzung eines Desktop-PCs erzielt werden.<br/>Falls Sie ein Smartphone verwenden, werfen Sie einen Blick auf die <a href='https://corona-tracing.cryptool.org/'>Corona-Tracing Visualisierungsseite</a>."
        },
        "step1": {
            "task": {
                "header": "Anleitung: 1) Simulieren Sie, dass Alice mit anderen Menschen Kontakt hat.",
                "para1": "Führen Sie bitte die folgenden Aktionen aus:<ol><li>Wählen Sie eine Person im Bereich \"<i>Broadcast-Historie einer anderen Person</i>\" aus.</li><li>Die Liste in diesem Bereich zeigt die Historie der <strong class='broadcast-ids'></strong>, die von der App der gewählten Person während bestimmter Zeitfenster abgesandt wurden.</li><li>Benutzen Sie die Button \"Vorheriger Tag\" und \"Nächster Tag\" um einen bestimmten Tag auszuwählen.</li><li>Klicken Sie auf einen der <strong class='broadcast-id'></strong>-Einträge, um einen Kontakt-Vorgang mit <strong>Alice</strong> innerhalb des entsprechenden Zeitfensters zu simulieren.</li></ol>",
                "para2": "Dann öffnet sich ein Dialog, in dem Sie die Dauer des Kontakts angeben können."
            },
            "success": {
                "header": "Anleitung: 2) Es wurde erfolgreich ein Kontakt simuliert!",
                "para1": "Sie haben erfolgreich simuliert, dass <strong>Alice</strong> zu einer anderen Person Kontakt hatte. Die <strong class='broadcast-id'></strong> der <strong>Tracing-App</strong> der anderen Person wurde von <strong>Alices</strong> <strong>Tracing-App</strong> empfangen und im Smartphone-Speicher aufgezeichnet. Sie wird im Bereich \"<i>Alices Kontaktliste</i>\" angezeigt.",
                "para2": "Der in <strong>Alices</strong> Kontaktliste gespeicherte Eintrag enthält weder Informationen über die andere Person noch ist es erforderlich, dass dieser Kontakt-Vorgang für jemanden öffentlich gemacht wird.<br />Des Weiteren wäre es nicht einmal möglich verschiedene Einträge in der Kontaktliste der gleichen Person zuzuordnen, da sich die <strong class='broadcast-ids'></strong> alle paar Minuten mittels eines kryptographisches Verfahrens ändern.",
                "para3": "Sie können nun weitere Kontakteinträge zu verschiedenen anderen Personen zu <strong>Alices</strong> Liste hinzufügen, oder mit dem nächsten Schritt der Anleitung fortfahren."

            }
        },
        "step2": {
            "task": {
                "header": "Anleitung: 3) Was passiert, wenn sich herausstellt, dass jemand infiziert ist?",
                "para1": "Hier können Sie simulieren was passiert, wenn eine Person heute erfährt, dass sie mit dem <strong>Coronavirus</strong> infiziert ist.</br>Das Ziel der <strong>Tracing-App</strong> ist es, <strong>Alice</strong> erfahren zu lassen, dass ein Kontakt mit einer infizierten Person innerhalb des Infektionszeitraums stattgefunden hat. Auf der anderen Seite soll die infizierte Person <strong>anonym</strong> bleiben.",
                "para2": "Sobald eine Person die Bestätigung ihrer Infektion erhält, werden die Gesundheitsbehörden sie berechtigen, sich freiwillig mittels der <strong>Tracing-App</strong> zu melden.",
                "para3": "Bitte führen Sie die folgenden Aktionen aus:<ol><li>Wählen Sie eine Person im Bereich \"<i>Broadcast-Historie einer anderen Person</i>\" aus und wählen Sie den Tag, von dem an diese Person als infektiös angenommen wird.</li><li>Klicken Sie auf den Button \"<i>Person meldet eigene Infektion</i>\" um zu simulieren, dass sich die Person selbst als infektiös mit Beginn ab dem gewählten Tag meldet.</li></ol>Melden Sie bitte für diese Anleitung eine Person, die bereits Kontakt mit <strong>Alice</strong> innerhalb des Infektionszeitraums hatte."
            },
            "error": {
                "header": "Anleitung: 3) Bitte überdenken Sie Ihre Meldung!",
                "para1": "Sie haben simuliert, dass sich eine Person selbst als infiziert meldet, welche während des Infektionszeitraums keinen Kontakt zu <strong>Alice</strong> hatte.",
                "para2": "Es handelt sich dabei um ein gültiges Szenario. Bitte melden Sie für diese Anleitung jedoch jemanden, der Kontakt mit <strong>Alice</strong> im Infektionszeitraum hatte.<br />Sie können jetzt auch einen neuen Kontakt-Vorgang zur gemeldeten Person hinzufügen, um dies zu erreichen."
            },
            "success": {
                "header": "Anleitung: 4) Eine Person, mit der Alice Kontakt hatte, meldete sich als infiziert.",
                "para1": "Sie haben erfolgreich simuliert, dass sich eine Person selbst als infektiös meldet. Das Ergebnis dieser Aktion ist, dass die <strong>Tracing-App</strong> der Person anonyme Daten an einen <strong>öffentlichen Server</strong> sendet. Nur Informationen, welche für die Kontakt-Verfolgung benötigt werden, werden versendet und gespeichert.<br />Genauer gesagt werden nur Informationen versendet, die benötigt werden, um alle <strong class='broadcast-ids'></strong> herzuleiten, die von der <strong>Tracing-App</strong> der Person während des Infektionszeitraums ausgestrahlt wurden.",
                "para2": "Auf die Informationen auf dem <strong>öffentlichen Server</strong> kann von jedem zugegriffen werden.",
                "para3": "Sie können nun die Meldung weiterer Personen simulieren, oder mit dem nächsten Schritt der Anleitung fortfahren."
            }
        },
        "step3": {
            "task": {
                "header": "Anleitung: 5) Wie erfährt Alice von dem Kontakt?",
                "para1": "Die <strong>Tracing-App</strong> von <strong>Alice</strong> ist in der Lage, auf alle Einträge des <strong>öffentlichen Servers</strong> zuzugreifen. Jeder Eintrag stellt eine nicht-personalisierte Information dar, nämlich den <strong class='day-key'></strong>. Dieser Schlüssel erlaubt die Herleitung aller <strong class='broadcast-ids'></strong> eines bestimmten Zeitraums mittels eines kryptographischen Verfahrens.",
                "para2": "Alices <strong>Tracing-App</strong> ist daher in der Lage, alle <strong class='broadcast-ids'></strong> der anderen Person während des Infektionszeitraums zu generieren und diese generierten EphIDs mit denen in ihrer persönlichen Kontaktliste abzugleichen. So kann sie herauszufinden, ob Sie Kontakt mit einer Person hatte, die sich selbst als infektiös gemeldet hat.",
                "para3": "Um das Vorgehen zu demonstrieren, klicken Sie bitte auf einen der Einträge des <strong>öffentlichen Servers</strong> im Bereich \"<i>Liste der Infektionen auf öffentlichem Server</i>\"."
            },
            "success": {
                "header": "Anleitung: 6) Überprüfung eines einzelnen Eintrags des öffentlichen Servers",
                "para1": "Sie können nun im Bereich \"<i>Abgleich des öffentlichen Servereintrags mit der Kontaktliste</i>\" alle <strong class='broadcast-ids'></strong> sehen, die aus dem <strong class='day-key'></strong> des Eintrags des <strong>öffentlichen Servers</strong> herleitbar sind.<br />Die Anzahl der Übereinstimmungen mit der Kontaktliste von <strong>Alice</strong> wird angezeigt.",
                "para2": "Während des gesamten bisherigen Ablaufs bestand für <strong>Alice</strong>  kein Bedarf, irgendwelche Daten an eine zentrale Instanz zu schicken. Ihre Kontaktliste verbleibt weiterhin exklusiv auf ihrem Smartphone.",
                "para3": "Sie können nun weitere Kontakteinträge erzeugen und weitere Personen melden, um den gesamten Mechanismus bei der Arbeit zu sehen.<br />Achten Sie besonders auf die Tatsache, dass Kontakteinträge von Personen, die sich <strong>nach</strong> dem Kontakt-Vorgang als infektiös melden, <strong>nicht</strong> zu einer Übereinstimmung mit <strong>Alices</strong> Kontaktliste führen."
            }
        }
    },
    "tour": {
        "nextButton": "Weiter",
        "backButton": "Zurück",
        "quitButton": "Tour verlassen",
        "step1": {
            "description": "Dieser Bereich enthält in der Spalte <strong class='broadcast-id'></strong> die Daten, die von den Tracing-Apps anderer Personen versendet wurden."
        },
        "step2": {
            "description": "Dieser Bereich enthält die Liste der Kontaktdaten, die lokal in Alices Tracing-App gespeichert werden."
        },
        "step3": {
            "description": "Dieser Bereich enthält die Daten über infizierte Personen, die der Öffentlichkeit zugänglich sind. Es sind keine personalisierten Informationen enthalten."
        },
        "step4": {
            "description": "In diesem Bereich können Sie einen einzelnen Eintrag vom Server auswählen und mit der persönlichen Kontaktliste von Alice abgleichen."
        },
        "step5": {
            "title": "Auswahl einer Person",
            "description": "In diesem Drop-down-Feld können Sie eine Person auswählen, für die Sie den Kontakt mit Alice simulieren möchten."
        },
        "step6": {
            "title": "Auswahl eines Tages",
            "description": "Mit diesem Pager können Sie einen Tag (innerhalb der letzten 2 Wochen) auswählen, um die <strong class='broadcast-ids'></strong> anzuzeigen, die von den Apps der ausgewählten Personen am ausgewählten Tag versandt wurden."
        },
        "step7": {
            "title": "Broadcast-Historie",
            "description": "Diese Liste zeigt alle <strong class='broadcast-ids'></strong>, die von der ausgewählten Person am ausgewählten Tag über Bluetooth versandt wurden. Sie können auf einen Eintrag klicken, um den Kontakt mit Alice innerhalb des gewählten Zeitfensters zu simulieren."
        },
        "step8": {
            "title": "Lassen Sie eine Person ihre Infektion melden",
            "description": "Wenn eine Person durch einen medizinischen Test erfährt, dass sie infiziert ist, erhält sie die Berechtigung, sich mit ihrer Tracing-App als infiziert zu melden. Sie können dies mit dieser Schaltfläche simulieren. Stellen Sie sicher, dass Sie den richtigen Tag auswählen, an dem die Infektion begonnen hat."
        },
        "step9": {
            "title": "Anleitung",
            "description": "Nach dieser geführten Anleitung können Sie nun selbst aktiv werden, um spielerisch mehr über das Protokoll zu erfahren. Klicken Sie auf diesen Button, um die Schritte / Aktionen der Anleitung aufzurufen."
        }
    },
    "broadcastHistory": {
        "header": "Broadcast-Historie einer anderen Person",
        "person": "Person",
        "initialKey": "Initialer Schlüssel",
        "initialKeyPopover": "Der initiale Schlüssel ist ein zufälliger Wert, der für jede Person generiert und nur geheim auf dem Gerät der Person gespeichert wird.\nDer initiale Schlüssel dieser Person ist:",
        "previousDay": "Vorheriger Tag",
        "nextDay": "Nächster Tag",
        "reportTooltip": "Die Person meldet sich ab dem ausgewählten Tag als infektiös.\nDie relevanten privaten Informationen werden an den öffentlichen Server gesendet.",
        "reportCaption": "Person meldet eigene Infektion",
        "description": {
            "para1": "Die folgende Historie listet alle <strong class='broadcast-ids'></strong> auf, die von <strong><span class='current-person'></span></strong> am <strong><span class='current-day'></span></strong> während bestimmter Zeitfenster dieses Tages abgesandt wurden. Die <strong class='broadcast-ids'></strong> werden alle <strong><span class='broadcast-id-refresh'></span> Minuten erneuert.",
            "para2": "Klicken Sie auf einen Eintrag in der Liste, um zu simulieren, was passieren würde, wenn <strong>Alice</strong> in diesem Zeitfenster Kontakt zu <strong><span class='current-person'></span></strong> gehabt hätte."
        },
        "timeSlotTooltip": "Das Zeitfenster während welchem die <strong class='broadcast-id'></strong> von der gewählten Person ausgestrahlt wurde.",
        "timeSlot": "Zeitfenster",
        "broadcastIdTooltip": "Jede <strong class='broadcast-id'></strong> wird während kurzen Zeitfenstern von <span class='broadcast-id-refresh'></span> Minuten über Bluetooth ausgestrahlt.\nSie werden von den Tracing-Apps anderer Personen in der Nähe aufgezeichnet, enthalten jedoch keine personalisierten Informationen.",
        "addContactModal": {
            "title": "Zu Alices Kontaktliste hinzufügen?",
            "question": "Sind Sie sicher, dass sie Kontakt mit <b><span id='add-contact-list-modal-person'></span></b> um <b><span id='add-contact-list-modal-timeslot'></span></b> zu Alices Kontaktliste hinzufügen wollen?",
            "duration": "Kontaktdauer",
            "minute": "Minute",
            "minutes": "Minuten",
            "cancel": "Abbrechen",
            "add": "Hinzufügen"
        },
        "reportModal": {
            "title": "Zur öffentlichen Serverliste hinzufügen?",
            "question": "Sind Sie sicher, dass Sie <b><span id='add-server-list-modal-person'></span></b> als infektiös beginnend ab dem Tag <b><span id='add-server-list-modal-day'></span></b> melden wollen?",
            "info": "Die relevanten anonymen <strong  class='day-keys'></strong> werden der Öffentlichkeit zugänglich sein.",
            "cancel": "Abbrechen",
            "add": "Hinzufügen"
        }
    },
    "contactList": {
        "header": "Alices Kontaktliste",
        "description": {
            "para1": "Die App von Alice speichert alle <strong class='broadcast-ids'></strong> in ihrer privaten Kontaktliste, die bei Kontakten mit den Apps anderer Personen über Bluetooth gesammelt wurden.",
            "para2": "Diese Liste ist niemandem sonst zugänglich."
        },
        "dayTooltip": "Der Tag an dem der Kontakt auftrat.",
        "day": "Tag",
        "durationTooltip": "Die Dauer des Kontakts. Diese ist relevant für die Tracing-App, um zu bestimmen, wie intensiv der Kontakt zu einer oder mehreren Personen war. Der App-Benutzer wird nur gewarnt falls ein bestimmt Intensitäts-Schwellwert erreicht wurde.",
        "duration": "Dauer",
        "broadcastIdTooltip": "Die <strong class='broadcast-id'></strong> die von der Tracing-App der Kontakt-Person ausgestrahlt wurde. Die <strong class='broadcast-id'></strong> gibt keine Informationen über die Kontaktperson preis."
    },
    "matchingList": {
        "header": "Abgleich des öffentlichen Servereintrags mit der Kontaktliste",
        "altDescription": "Wählen Sie einen Eintrag vom öffentlichen Server aus, um zu prüfen, ob er in Alices Kontaktliste enthalten ist.",
        "description": {
            "para1": "Hier werden alle <strong class='broadcast-ids'></strong> angezeigt, die Alices App aus dem <strong class='day-key'></strong> eines Server-Eintrags hergeleitet hat",
            "para2": "Jeder Eintrag in dieser generierten Liste (Tag und <strong class='broadcast-id'></strong>) wird gegen die Kontaktliste von Alice abgeglichen werden, um herauszufinden, ob ein Kontakt mit einer infizierten Person stattfand.",
            "para3": "Anzahl der Übereinstimmungen mit Alices Kontaktliste: <strong><span id='matching-counter'></span></strong>"
        },
        "matchButtonTooltip": "Durch Aktivieren des Filters werden alle Einträge in dieser Liste ausgeblendet, die nicht mit einem <strong class='broadcast-id'></strong>-Eintrag in Alices Kontaktliste übereinstimmen.",
        "matchButtonCaption": "Filtere passende <strong class='broadcast-ids'></strong>",
        "dayTooltip": "Der Tag an welchem diese <strong class='broadcast-id'></strong> ausgestrahlt wurde.",
        "day": "Tag",
        "broadcastIdTooltip": "Die <strong class='broadcast-id'></strong> welche von einer infizierten Person ausgestrahlt wurde."
    },
    "serverList": {
        "header": "Liste der Infektionen auf öffentlichem Server",
        "description": {
            "para1": "Der öffentliche Server speichert eine Liste, die die <strong class='day-keys'></strong> von infizierten Personen enthält. Die Personen meldeten diese freiwillig.",
            "para2": "Die Daten sind anonym (zwischen ihnen und einer tatsächlichen Person kann keine Verbindung hergestellt werden)."
        },
        "dayTooltip": "Der Tag zu welchem der <strong class='day-key'></strong> gehört.",
        "day": "Tag",
        "dayKeyTooltip": "Eine Information, die für die Tracing-App des Benutzers privat war, bevor sie gemeldet wurde.\nEs ermöglicht das Ableiten aller <strong class='broadcast-ids'></strong>, die von der Person an einem oder mehreren Tagen gesendet wurden."
    },
    "sizeWarning": {
        "header": "<strong>Achtung:</strong> Der Bildschirm Ihres Geräts ist zu klein, um diese Seite zu verwenden!"
    }
}
