{
  "TITLE": "Passwordmeter",
  "DESCRIPTION": "How secure your password is classified by different evaluation methods, you can check here purely locally. Your entries are neither transferred nor stored. For a good password, the length is most important.",
  "DISCLAIMER": "Please note that this tool is only an indication and that a good rating does not guarantee an unbreakable password. That the 5 methods give different results is normal.",
  "SHOW_PASSWORD": "Show password",
  "LENGTH": "Length",
  "ENTER_PASSWORD": "Enter the password you want to get evaluated",
  "USE_WORDLISTS": "Manage dictionaries",
  "BROWSER_COMPATIBILITY_WARNING": "Your browser does not support all the technologies used. If this tool does not work for you, please update your browser. If the plugin still fails to run as expected, please write us a message via the contact form.",
  "LONG_PASSWORD_WARNING": "For very long passwords, the rating may take longer and your browser may not respond immediately.",
  "WORDLISTS": "Dictionaries",
  "NAME": "Name",
  "WORDS": "Words",
  "REMOVE_WORDLIST": "Remove dictionary",
  "ADD_WORDLIST": "Add local dictionary",
  "WORDLIST_ONLY_USED_BY_PS": "These dictionaries are only used by the method \"Stutz' PS\". A dictionary file must contain one word per line.",
  "RATING": "Rating",
  "TOTAL": "Total",
  "BAR_COLOR_HINT": "The color of the progress bar indicates the password strength: red = very weak, yellow = medium and green = very strong.",
  "TIME_TO_CRACK_ONLINE": "Time to crack (online)",
  "TIME_TO_CRACK_OFFLINE": "Time to crack (offline)",
  "FOUND_SEQUENCES": "Sequences found",
  "NOTICE": "Notice",
  "IMPROVEMENT_SUGGESTIONS": "Suggestions for improvement",
  "CRACKTIME_HINT": "When estimating the online cracktime, it is assumed that an attacker has no access restrictions, the server responds immediately and does not wait even after a certain number of attempts. <br/> For offline cracktime, we assume that the attacker uses a fast PC and knows the password hash, and that the passwords have been hashed using a slow hashing method. If a fast hashing method was used instead, the time required will be significantly shorter.",
  "AVERAGE_CRACKTIME": "Average cracktime",
  "PATTERN": "Pattern",
  "ENTROPY": "Entropy",
  "TYPE": "Type",
  "MANUAL": "How to use",
  "HOW_TO_RATE_QUESTION": "How can I have my password rated?",
  "HOW_TO_RATE_ANSWER": "<img src=\"/_ctoApps/passwordmeter/images/s1_inputfield.png\" /> To have a password evaluated, enter it in the input field. As a result, the quality of the password will be estimated by various methods. The evaluations of the different methods will be displayed in the form of a colored progress bar. The total ranking is also displayed in the form of a colored progress bar. <img src=\"/_ctoApps/passwordmeter/images/s2_rating.png\" /> The color of the bar reflects the quality: red means \"very weak\", yellow means \"medium\", and green means \"very good\". The exact quality and possibly also the entropy values of the password are output as percentages next to the bars. <img src=\"/_ctoApps/passwordmeter/images/s3_details_without_dictionaries.png\" /> The methods \"zxcvbn\" and \"Stutz' PS\" provide more information about the password, such as found sequences and the estimated cracking time. In addition, zxcvbn also shows suggestions to improve passwords labeled \"weak\".",
  "HOW_TO_USE_DICTIONARIES_QUESTION": "How can I use dictionaries from the server?",
  "HOW_TO_USE_DICTIONARIES_ANSWER": "<img src=\"/_ctoApps/passwordmeter/images/s4_load_dictionaries.png\" /> Stutz' PS offers the ability to have the password checked for crackability through a dictionary attack. For this, mark the checkbox at \"Manage dictionaries\". After that, a new area will be shown and two standard dictionaries will be downloaded. These contain the most common words from the English and German languages. <img src=\"/_ctoApps/passwordmeter/images/s5_choose_dictionaries.png\" /> Once the dictionaries have finished downloading, they can be used by marking them with a tick.",
  "HOW_TO_USE_CUSTOM_DICTIONARY_QUESTION": "How can I use custom dictionaries?",
  "HOW_TO_USE_CUSTOM_DICTIONARY_ANSWER": "<img src=\"/_ctoApps/passwordmeter/images/s6_select_own_dictionary.png\" /> You can include your own custom dictionaries by clicking \"Choose File\" and selecting a dictionary file from your hard disk. <img src=\"/_ctoApps/passwordmeter/images/s7_details_with_dictionaries.png\" /> The dictionary then is loaded into the memory of your browser and is used by the method \"Stutz' PS\". The other rating methods don't use dictionaries. <img src=\"/_ctoApps/passwordmeter/images/s8_example_dictionary.png\" /> A dictionary file always contains one word per line and can not be larger than the available memory in your browser. A word is always the string of a line up to the first occurrence of a space.",
  "PLUGIN_NOT_WORKING_QUESTION": "The plugin does not work, what now?",
  "PLUGIN_NOT_WORKING_ANSWER": "If the plugin does not work for you as described here, please update your browser. If the plugin still does not work as expected, please write us a message via the contact form.",
  "ADDITIONAL_INFO": "Further information",
  "HOW_TO_CREATE_A_GOOD_PASSWORD_QUESTION": "How do I create a good password?",
  "HOW_TO_CREATE_A_GOOD_PASSWORD_ANSWER": "By now we know: More important than the use of different character types (special characters, capital letters and numbers) is the length of the password. Therefore, make sure that your password has more than 12 characters, is random and contains no personal information. Adding a few special characters, capital letters and numbers does not hurt either. But make sure that you do not use them instead of letters or only at the end of the password. This 11 minutes <a href=\"https://youtu.be/3NjQ9b3pgIg\" target=\"_blank\">YouTube video</a> gives a more detailed insight.",
  "HOW_TO_CRACK_A_PASSWORD_QUESTION": "How can my password be cracked?",
  "HOW_TO_CRACK_A_PASSWORD_ANSWER": "Usually an attacker only has the possibility to try out common passwords, often used strings, words from a dictionary, and varying characters (for example, a \"3\" instead of an \"e\"). If he also has personal information about you, he will also include data such as your date of birth. For a good demonstration, check out this 20 minutes <a href=\"https://youtu.be/7U-RbOKanYs\" target=\"_blank\">YouTube video</a>.",
  "DIFFERENT_PASSWORD_FOR_EACH_SERVICE_QUESTION": "Do I need a different password for each service?",
  "DIFFERENT_PASSWORD_FOR_EACH_SERVICE_ANSWER": "Yes. Because in case that one of your passwords gets into the wrong hands, the damage should be minimal: If an attacker finds out the password of your facebook account, he should not be able to buy things at Amazon on your invoice.",
  "PASSWORD_STORING_QUESTION": "How can I store my password safely?",
  "PASSWORD_STORING_ANSWER": "Ideally, of course, in your head. If you still wish to write down your password, be sure to keep it in a secure place (such as a safe). A good alternative are encrypted password files and <a href=\"https://en.wikipedia.org/wiki/Password_management\" target=\"_blank\">password managers</a> such as <a href=\"https://keepass.info/\" target=\"_blank\">KeePass</a>.",
  "METHOD_ORIGIN_QUESTION": "Where do the chosen methods come from?",
  "METHOD_ORIGIN_ANSWER": "The upper three methods are from the applications KeePass, Mozilla Firefox and PGP. Each of them has an integrated password quality meter. The methods \"zxcvbn\" and <a target=\"_blank\" href=\"https://davidstutz.github.io/password-score/index.html\">\"Stutz' Password-Score\"</a> have both been inspired by <a target=\"_blank\" href=\"https://blogs.dropbox.com/tech/2012/04/zxcvbn-realistic-password-strength-estimation/\">this article</a> (Dan Wheeler, 2012).",
  "HOW_TO_RATE_PASSWORDS_QUESTION": "How is the quality of a password rated?",
  "HOW_TO_RATE_PASSWORDS_ANSWER": "Most methods evaluate the quality of a password based on entropy. This approach is followed by e.g. the applications KeePass and PGP. It is assumed that a quality of 100% corresponds to an entropy of 128 bits. The method \"Stutz' Password-Score\" uses a custom function to map the entropy to a percentage value. In the Mozilla method, the available characters are divided into groups of characters, which are then evaluated differently (for example, special characters and lowercase letters). The methods \"zxcvbn\" and \"Stutz' Password-Score\" additionally test the password for repetitive characters, keyboard sequences, and words that appear in a dictionary. The rating of the various methods usually lead to different results."
}